import { Component } from '@angular/core';

@Component({
  selector: 'app-all-services',
  templateUrl: './all-services.component.html',
  styleUrls: ['./all-services.component.scss', './../../../styles.scss']
})
export class AllServicesComponent {
  data: any = [
    {
      name: "รับจดเครื่องหมายการค้า",
      description: "บริการรับจดทะเบียนเครื่องหมายการค้า เครื่องหมายร่วม จดลิขสิทธิ์โลโก้ จดแบรนด์ ในประเทศไทย"
    },
    {
      name: "รับจดสิทธิบัตร อนุสิทธิบัตร",
      description: "บริการรับจดทะเบียนสิทธิบัตร สิทธิบัตรการประดิษฐ์ อนุสิทธิบัตร และสิทธิบัตรการออกแบบผลิตภัณฑ์"
    },
    {
      name: "รับจดลิขสิทธิ์",
      description: "บริการรับจดทะเบียนเครื่องหมายการค้า เครื่องหมายร่วม จดลิขสิทธิ์โลโก้ จดแบรนด์ ในประเทศไทย"
    },
    {
      name: "รับจดเครื่องหมายการค้า",
      description: "บริการรับจดทะเบียนเครื่องหมายการค้า เครื่องหมายร่วม จดลิขสิทธิ์โลโก้ จดแบรนด์ ในประเทศไทย"
    },
    {
      name: "รับว่าความ รับจ้างเป็นทนายความ",
      description: "บริการรับจดทะเบียนเครื่องหมายการค้า เครื่องหมายร่วม จดลิขสิทธิ์โลโก้ จดแบรนด์ ในประเทศไทย"
    },
    {
      name: "รับจดเครื่องหมายการค้าจีน เครื่องหมายการค้าต่างประเทศ",
      description: "บริการรับจดทะเบียนเครื่องหมายการค้า เครื่องหมายร่วม จดลิขสิทธิ์โลโก้ จดแบรนด์ ในประเทศไทย"
    },
    {
      name: "รับจดสิทธิบัตรต่างประเทศ",
      description: "บริการรับจดทะเบียนเครื่องหมายการค้า เครื่องหมายร่วม จดลิขสิทธิ์โลโก้ จดแบรนด์ ในประเทศไทย"
    },
    {
      name: "รับขึ้นทะเบียนและจดบัญชีนวัตกรรมไทย",
      description: "บริการรับจดทะเบียนเครื่องหมายการค้า เครื่องหมายร่วม จดลิขสิทธิ์โลโก้ จดแบรนด์ ในประเทศไทย"
    },
    {
      name: "รับจดทะเบียนและขอใบอนุญาต มอก. สมอ.",
      description: "บริการรับจดทะเบียนเครื่องหมายการค้า เครื่องหมายร่วม จดลิขสิทธิ์โลโก้ จดแบรนด์ ในประเทศไทย"
    },
    {
      name: "รับจดทะเบียนและขอใบอนุญาต อย.",
      description: "บริการรับจดทะเบียนเครื่องหมายการค้า เครื่องหมายร่วม จดลิขสิทธิ์โลโก้ จดแบรนด์ ในประเทศไทย"
    }
  ]
  isImageLoaded01 = false;
  
  onImageLoad(picture: string) {
    if (picture === 'isImageLoaded01') {
      this.isImageLoaded01 = true;
    }
  }
}
